# SQL Assignment

In [2]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [ ]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [3]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [4]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [5]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [5]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    print(q1_results.shape)
    assert (q1_results.shape == (232,3))

query1 = """ SELECT person.Name,Movie.year,Movie.Title FROM person 
JOIN M_Producer ON Person.PID = TRIM(M_Producer.PID)
JOIN Movie ON M_Producer.MID = Movie.MID
JOIN M_Genre ON Movie.MID = M_Genre.MID
JOIN Genre ON M_Genre.GID = TRIM(Genre.GID)

WHERE (((Movie.year % 4 = 0) AND (Movie.year % 100 != 0)) OR ((Movie.year % 400 = 0) AND (Movie.year % 100 = 0)))
AND Genre.Name LIKE '%Comedy%'
"""
grader_1(query1)

               Name  year                         title
0     Satyendra Pal  1976                    Hera Pheri
1      Guddu Dhanoa  1992                       Deewana
2      Lalit Kapoor  1992                       Deewana
3      Raju Kothari  1992                       Deewana
4       K.K. Nayyar  1992                       Deewana
5   A.G. Nadiadwala  2000                    Hera Pheri
6         Gul Anand  1972                 Gora Aur Kala
7    Rajkumar Kohli  1972                 Gora Aur Kala
8     Gulshan Anand  1972                 Gora Aur Kala
9     Eeshwar Nivas  2008  My Name Is Anthony Gonsalves
(922, 3)

AssertionError:

In [190]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    print(q1_results.shape)
    assert (q1_results.shape == (232,3))

query1 = """ SELECT person.Name,Movie.year,Movie.Title FROM person 
JOIN M_director ON M_director.PID = TRIM(Person.PID)
JOIN Movie ON Movie.MID = M_director.MID
JOIN M_Genre ON M_Genre.MID = Movie.MID
JOIN Genre ON Genre.GID = TRIM(M_Genre.GID)
WHERE (((Movie.year % 4 = 0) AND (Movie.year % 100 != 0)) OR ((Movie.year % 400 = 0) AND (Movie.year % 100 = 0)))
AND (Genre.Name LIKE '%Comedy%')
"""
grader_1(query1)

                Name  year                            title
0      Griffin Dunne  2008           The Accidental Husband
1   Mahesh Manjrekar  2000   Jis Desh Mein Ganga Rehta Hain
2            Madonna  2008                 Filth and Wisdom
3    Gurinder Chadha  2004                Bride & Prejudice
4       Frank Coraci  2004      Around the World in 80 Days
5   Tarun Mansukhani  2008                          Dostana
6        Lekh Tandon  1968                 Jhuk Gaya Aasman
7     S.S. Rajamouli  2012                             Eega
8      Jugal Hansraj  2008                   Roadside Romeo
9         Mike Judge  1996  Beavis and Butt-Head Do America
(246, 3)

AssertionError:

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [6]:
%%time
def grader_1(q1,q2,q3):
    q1_results  = pd.read_sql_query(q1,conn)
    q2_results = pd.read_sql_query(q2,conn)
    q3_r = pd.read_sql_query(q3,conn)
    
    print(q1_results.head(10))
    print(q2_results)
    print(q3_r)
    print(q1_results.shape)
    
    assert (q1_results.shape == (17,1))
query1 = """ SELECT PID FROM M_cast WHERE MID IN (SELECT MID FROM movie WHERE title = 'Anand')  """
query2 = """ SELECT name FROM Person WHERE PID = 'nm0004435' """
q3= """ SELECT name FROM person WHERE PID =(SELECT trim(PID) FROM M_cast WHERE MID IN (SELECT MID FROM movie WHERE title = 'Anand')) """
grader_1(query1,query2,q3)

          PID
0   nm0004435
1   nm0000821
2   nm0764407
3   nm0219946
4   nm0219947
5   nm0783996
6   nm0222743
7   nm0695155
8   nm0474931
9   nm1783998
             Name
0   Rajesh Khanna
             Name
0   Rajesh Khanna
(17, 1)
CPU times: total: 31.2 ms
Wall time: 34.1 ms

In [5]:
%%time
# https://www.javatpoint.com/sql-join

def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (17,1))

query1 = """ SELECT Name
FROM Person 
JOIN M_Cast ON Person.PID = TRIM(M_Cast.PID) 
JOIN Movie  ON Movie.MID = M_Cast.MID 
WHERE Movie.title = 'Anand' AND Movie."year" = 1971 """
grader_1(query1)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2     Brahm Bhardwaj
3         Ramesh Deo
4          Seema Deo
5         Dev Kishan
6        Durga Khote
7      Lalita Kumari
8       Lalita Pawar
9       Atam Prakash
CPU times: total: 250 ms
Wall time: 247 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [8]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select * from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select * from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

      index        PID             Name  Gender         PD        MID
0      1860  nm0719692   Michael Rennie    Male  nm0719692  tt0043456
1      1861  nm0623658    Patricia Neal  Female  nm0623658  tt0043456
2      1862  nm0549280     Hugh Marlowe    Male  nm0549280  tt0043456
3      1863  nm0415488        Sam Jaffe    Male  nm0415488  tt0043456
4      1864  nm0336474       Billy Gray    Male  nm0336474  tt0043456
...     ...        ...              ...     ...        ...        ...
4937  24201  nm0004660         Rajkumar    Male  nm0004660  tt0290632
4938  32092  nm0672784   Sabitha Perara  Female  nm0672784  tt0290632
4939  12384  nm0482285          Lakshmi  Female  nm0482285  tt0290632
4940   5375  nm0004334            Rekha  Female  nm0004334  tt0290632
4941  32127  nm0066829            Iqbal  Female  nm0066829  tt0375882

[4942 rows x 6 columns]
       index        PID                   Name  Gender         PD        MID
0          0  nm0000288         Christian Bale    Male  nm0000288  tt2388771
1          1  nm0000949         Cate Blanchett  Female  nm0000949  tt2388771
2          2  nm1212722   Benedict Cumberbatch    Male  nm1212722  tt2388771
3          3  nm0365140          Naomie Harris  Female  nm0365140  tt2388771
4          4  nm0785227            Andy Serkis    Male  nm0785227  tt2388771
...      ...        ...                    ...     ...        ...        ...
62565   8192  nm0664109           Yunus Parvez    Male  nm0664109  tt0375890
62566   4424  nm0505323           Johnny Lever    Male  nm0505323  tt0375890
62567  12436  nm0019427             Ishrat Ali    Male  nm0019427  tt0375890
62568  12028  nm0197582           Sudhir Dalvi    Male  nm0197582  tt0375890
62569  15798  nm0438467          Bharat Kapoor    Male  nm0438467  tt0375890

[62570 rows x 6 columns]
False
CPU times: total: 625 ms
Wall time: 630 ms

In [9]:
%%time
# https://www.geeksforgeeks.org/sql-with-clause/  FOR WITH CLAUSE
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    print(q3_results.shape)
    assert (q3_results.shape == (300,1))

query3 = """
WITH
case_more90 AS (SELECT p.PID from Person p 
inner join 
(
SELECT trim(mc.PID) PD, mc.MID FROM M_cast mc WHERE mc.MID 
in (SELECT mv.MID FROM Movie mv WHERE CAST(SUBSTR(mv.year,-4) AS Integer)>1990)
) r1 
on r1.PD=p.PID) ,

case_less70 AS (SELECT p.PID from Person p 
inner join 
(
SELECT trim(mc.PID) PD, mc.MID FROM M_cast mc WHERE mc.MID 
in (SELECT mv.MID FROM Movie mv WHERE CAST(SUBSTR(mv.year,-4) AS Integer)<1970)
) r1 
on r1.PD=p.PID) 

SELECT P1.name FROM person p1
WHERE (TRIM(P1.PID) IN case_more90) AND (TRIM(P1.PID) IN case_less70)
"""
grader_3(query3)

                Name
0       Rishi Kapoor
1   Amitabh Bachchan
2             Asrani
3       Zohra Sehgal
4    Parikshat Sahni
5      Rakesh Sharma
6        Sanjay Dutt
7          Ric Young
8              Yusuf
9     Suhasini Mulay
(300, 1)
CPU times: total: 422 ms
Wall time: 427 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [11]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    print(query_4a.shape)
    return (query_4a.shape == (1462,2))

query_4a =""" 
SELECT md.PID AS Director_id, COUNT(*) AS Movie_Count FROM M_Director md GROUP BY md.PID 
"""
print(grader_4a(query_4a))

  Director_id  Movie_Count
0   nm0000180            1
1   nm0000187            1
2   nm0000229            1
3   nm0000269            1
4   nm0000386            1
5   nm0000487            2
6   nm0000965            1
7   nm0001060            1
8   nm0001162            1
9   nm0001241            1
(1462, 2)
True
CPU times: total: 0 ns
Wall time: 8 ms

In [12]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    print(q4_results.shape)
    assert (q4_results.shape == (58,2))

query4 = """ WITH
needed_pid_count AS (SELECT md.PID,COUNT(MID) AS Movie_count FROM M_director md GROUP BY md.PID HAVING Movie_count >= 10) 

SELECT p.name,Co.Movie_count 
FROM person p 
JOIN needed_pid_count Co ON P.PID = Co.PID

"""
grader_4(query4)

                 Name  Movie_count
0    Mahesh Manjrekar           15
1    Tigmanshu Dhulia           10
2      Satish Kaushik           12
3      Anurag Kashyap           13
4         Yash Chopra           21
5        Subhash Ghai           18
6       Rakesh Roshan           13
7   Madhur Bhandarkar           12
8         Ketan Mehta           11
9        Mahesh Bhatt           35
(58, 2)
CPU times: total: 31.2 ms
Wall time: 25 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [34]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    print(query_5aa.shape)
    return (query_5aa.shape == (8846,3))

query_5aa =""" 
SELECT m.MID, p.Gender, COUNT(p.Gender) as count
    FROM Movie m
    JOIN M_Cast mc ON m.MID = mc.MID
    JOIN Person p ON trim(mc.PID) = p.PID
    GROUP BY mc.MID,p.Gender
"""

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab =""" 
SELECT MC.MID ,p.Gender , COUNT(p.Gender) as COUNT
FROM M_Cast MC
INNER JOIN Person p ON p.PID=TRIM(MC.PID)
WHERE p.Gender IN ('Male', 'NULL')
GROUP BY MC.MID
"""

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID  Gender  count
0  tt0021594    None      0
1  tt0021594  Female      3
2  tt0021594    Male      5
3  tt0026274    None      0
4  tt0026274  Female     11
5  tt0026274    Male      9
6  tt0027256    None      0
7  tt0027256  Female      5
8  tt0027256    Male      8
9  tt0028217  Female      3
(8846, 3)
True
         MID Gender  COUNT
0  tt0021594   Male      5
1  tt0026274   Male      9
2  tt0027256   Male      8
3  tt0028217   Male      7
4  tt0031580   Male     27
5  tt0033616   Male     46
6  tt0036077   Male     11
7  tt0038491   Male      7
8  tt0039654   Male      6
9  tt0040067   Male     10
True
CPU times: total: 656 ms
Wall time: 639 ms

In [19]:
%%time

def grader_5a(query_5a):
    query_5a = pd.read_sql_query(query_5a,conn)
    print(query_5a.head(10)) 
    print(query_5a.shape)
    return (query_5a.shape == (4,2))

query_5a ="""  
    WITH 
    all_cast AS 
    (SELECT m.mid ,count(DISTINCT(m.MID)) as count, TRIM(p.Gender), TRIM(p.Gender), SUBSTR(m.year,-4) AS year
    FROM Movie m
    JOIN M_Cast mc ON m.MID = mc.MID
    JOIN Person p ON trim(mc.PID) = p.PID
    GROUP BY mc.MID, p.Gender)
    ,
    male_present AS 
    (SELECT MC.MID ,p.Gender , COUNT(p.Gender) as COUNT
    FROM M_Cast MC
    INNER JOIN Person p ON p.PID=TRIM(MC.PID)
    WHERE p.Gender = 'Male'
    GROUP BY MC.MID)


SELECT a.YEAR,a.count
FROM all_cast a
WHERE NOT EXISTS (SELECT * FROM male_present WHERE a.mid = mid)
GROUP BY a.year,a.MID
"""

grader_5a(query_5a)
# using the above queries, you can write the answer to the given question

   year  count
0  1939      1
1  1999      1
2  2000      1
3  2018      1
(4, 2)
CPU times: total: 734 ms
Wall time: 711 ms

True

In [12]:
%%time

def grader_5a(query_5a):
    query_5a = pd.read_sql_query(query_5a,conn)
    print(query_5a.head(10)) 
    print(query_5a.shape)
    return (query_5a.shape == (4,2))

query_5a ="""  
WITH all_cast AS 
    (SELECT SUBSTR(m."year",-4) as 'Year', m.title, trim(m.MID) as MID, p.Name, trim(p.Gender) as Gender  
    FROM Movie m
    JOIN M_Cast mc ON (m.MID = mc.MID)
    JOIN Person p ON (trim(mc.PID) = p.PID))
        ,   
male_present AS (
    SELECT year, mid, name
    FROM all_cast
    WHERE Gender = 'Male')


SELECT year, COUNT(DISTINCT mid) as 'All Female Cast'
FROM all_cast a
WHERE NOT EXISTS (SELECT * FROM male_present WHERE a.mid = mid)
GROUP BY year
"""

grader_5a(query_5a)

   Year  All Female Cast
0  1939                1
1  1999                1
2  2000                1
3  2018                1
(4, 2)
CPU times: total: 2.05 s
Wall time: 2.11 s

True

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [21]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ 
WITH 
    all_cast AS 
    (SELECT m.MID, p.Gender, COUNT(p.Gender) as count, SUBSTR(m.year,-4) AS year
    FROM Movie m
    JOIN M_Cast mc ON m.MID = mc.MID
    JOIN Person p ON trim(mc.PID) = p.PID
    GROUP BY mc.MID, p.Gender)
    ,
    male_present AS 
    (SELECT MC.MID ,p.Gender , COUNT(p.Gender) as COUNT
    FROM M_Cast MC
    INNER JOIN Person p ON p.PID=TRIM(MC.PID)
    WHERE p.Gender IN ('Male', 'NULL')
    GROUP BY MC.MID)
    ,
    Total_movies_per_year AS 
    (SELECT M."year", COUNT(*) AS 'total_movies' 
    FROM Movie as M GROUP BY M."year")
    
   
    
SELECT a.year, a.count*100/T.total_movies AS Percentage_Female_Only_Movie ,T.total_movies
FROM all_cast a
JOIN Total_movies_per_year T ON T."year"=a.'year'
WHERE NOT EXISTS (SELECT * FROM male_present WHERE a.mid = mid)
GROUP BY a.year,a.MID

"""
grader_5b(query5b)

   year  Percentage_Female_Only_Movie  total_movies
0  1939                            50             2
1  1999                            16            66
2  2000                            15            64
3  2018                             2            93
CPU times: total: 672 ms
Wall time: 670 ms

In [42]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))
    
query5b ="""
 WITH 
    all_cast AS 
    (SELECT m.mid ,count(DISTINCT(m.MID)) as count, TRIM(p.Gender), TRIM(p.Gender), SUBSTR(m.year,-4) AS year
    FROM Movie m
    JOIN M_Cast mc ON m.MID = mc.MID
    JOIN Person p ON trim(mc.PID) = p.PID
    GROUP BY mc.MID, p.Gender)
    ,
    male_present AS 
    (SELECT MC.MID ,p.Gender  ,count(DISTINCT(mc.MID)) as count
    FROM M_Cast MC
    INNER JOIN Person p ON p.PID=TRIM(MC.PID)
    WHERE p.Gender = 'Male'
    GROUP BY MC.MID)
    ,
    movies_per_year AS
    (SELECT COUNT(DISTINCT(m.mid)) as count, SUBSTR(m.year,-4) AS year
    FROM M_cast mc 
    join movie m ON (TRIM(mc.mid)=m.mid )
    group by SUBSTR(m.year,-4)
    )


SELECT a.year, CAST(a.count AS float)/CAST(T.count AS float) AS Percentage_Female_Only_Movie ,T.count
FROM all_cast a
JOIN movies_per_year T ON T."year"=a.'year'
WHERE NOT EXISTS (SELECT * FROM male_present WHERE a.mid = mid)
GROUP BY a.year,a.MID


"""
grader_5b(query5b)

   year  Percentage_Female_Only_Movie  count
0  1939                      0.500000      2
1  1999                      0.015152     66
2  2000                      0.015625     64
3  2018                      0.009615    104
CPU times: total: 891 ms
Wall time: 891 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [ ]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ *** Write your query for the question 5b *** """
grader_6(query6)

                        title  count
0               Ocean's Eight    238
1                    Apaharan    233
2                        Gold    215
3             My Name Is Khan    213
4  Captain America: Civil War    191
5                    Geostorm    170
6                     Striker    165
7                        2012    154
8                      Pixels    144
9       Yamla Pagla Deewana 2    140
Wall time: 232 ms

In [115]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    print(q6_results.shape)
    assert (q6_results.shape == (3473, 2))

query6 = """ 
SELECT  M.Title,COUNT(mc.PID) AS count
FROM M_cast mc
JOIN Movie M ON mc.MID=M.MID
GROUP BY mc.MID
ORDER BY count DESC
"""
grader_6(query6)

                        title  count
0               Ocean's Eight    238
1                    Apaharan    233
2                        Gold    215
3             My Name Is Khan    213
4  Captain America: Civil War    191
5                    Geostorm    170
6                     Striker    165
7                        2012    154
8                      Pixels    144
9       Yamla Pagla Deewana 2    140
(3473, 2)
CPU times: total: 156 ms
Wall time: 155 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [ ]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

query7a = """ *** Write a query that computes number of movies in each year *** """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies
0        1931             1
1        1936             3
2        1939             2
3        1941             1
4        1943             1
5        1946             2
6        1947             2
7        1948             3
8        1949             3
9        1950             2
Wall time: 12 ms

In [130]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    print(q7a_results.shape)
    assert (q7a_results.shape == (78, 2))

query7a = """ 
SELECT CAST(SUBSTR(TRIM(M.year),-4) AS INTEGER) AS Movie_year,COUNT(M.MID) AS Total_movie 
FROM Movie M
GROUP BY CAST(SUBSTR(TRIM(M.year),-4) AS INTEGER)
"""
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   Movie_year  Total_movie
0        1931            1
1        1936            3
2        1939            2
3        1941            1
4        1943            1
5        1946            2
6        1947            2
7        1948            3
8        1949            3
9        1950            2
(78, 2)
CPU times: total: 0 ns
Wall time: 9 ms

In [ ]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """   
    *** 
    Write a query that will do joining of the above table(7a) with itself 
    such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year
    *** 
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies  Movie_Year  Total_Movies
0        1931             1        1931             1
1        1931             1        1936             3
2        1931             1        1939             2
3        1936             3        1936             3
4        1936             3        1939             2
5        1936             3        1941             1
6        1936             3        1943             1
7        1939             2        1939             2
8        1939             2        1941             1
9        1939             2        1943             1
Wall time: 24 ms

In [6]:
def grader_7(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    print(q7b_results.shape)

query7 = """
WITH MOV AS
(
   SELECT year as movie_year, COUNT(MID) as total_movies
   FROM MOVIE 
   GROUP BY year
)
SELECT
  m1.movie_year as decade_start,
  MAX(m2.movie_year) as decade_end,
  SUM(m2.total_movies) as total_movies
FROM MOV m1
LEFT JOIN MOV m2 ON (m2.movie_year BETWEEN m1.movie_year AND m1.movie_year + 9)
GROUP BY m1.movie_year
ORDER BY SUM(m2.total_movies) DESC
LIMIT 1

"""
grader_7(query7)

  decade_start decade_end  total_movies
0         2008       2017          1126
(1, 3)

In [7]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    print(q7b_results.shape)
    
query7b = """   
WITH 
    DISTINCT_YEARS AS
    (SELECT DISTINCT CAST(SUBSTR(TRIM(year),-4) AS INTEGER) YEAR,
        CAST(SUBSTR(TRIM(year),-4) AS INTEGER) START_OF_DECADE,
        CAST(SUBSTR(TRIM(year),-4) AS INTEGER)+9 END_OF_DECADE,
        'Decade of : ' || SUBSTR(year,-4)   DECADE
    FROM Movie)
    ,
    NUMBER_OF_MOV_BY_YR AS
    (SELECT COUNT(DISTINCT MID) NUM_OF_MOV, CAST(SUBSTR(TRIM(year),-4) AS INTEGER) YEAR
    FROM Movie GROUP BY CAST(SUBSTR(TRIM(year),-4) AS INTEGER))
    ,
    NUM_OF_MOV_IN_DECADE AS 
    (SELECT SUM(NUM_OF_MOV) TOTAL_MOVIES,DY.DECADE
    FROM NUMBER_OF_MOV_BY_YR NM, DISTINCT_YEARS DY
    WHERE NM.YEAR BETWEEN DY.START_OF_DECADE AND DY.END_OF_DECADE
    GROUP BY DY.DECADE)
        
SELECT DECADE, TOTAL_MOVIES
FROM NUM_OF_MOV_IN_DECADE
WHERE TOTAL_MOVIES = 
    (SELECT MAX(TOTAL_MOVIES)
    FROM NUM_OF_MOV_IN_DECADE)
    """
grader_7b(query7b)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

             DECADE  TOTAL_MOVIES
0  Decade of : 2008          1203
(1, 2)
CPU times: total: 31.2 ms
Wall time: 22 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [ ]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

query8a = """ *** Write a query that will results in number of movies actor-director worked together ***"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

       actor   director  movies
0  nm0000002  nm0496746       1
1  nm0000027  nm0000180       1
2  nm0000039  nm0896533       1
3  nm0000042  nm0896533       1
4  nm0000047  nm0004292       1
5  nm0000073  nm0485943       1
6  nm0000076  nm0000229       1
7  nm0000092  nm0178997       1
8  nm0000093  nm0000269       1
9  nm0000096  nm0113819       1
Wall time: 534 ms

In [23]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    print(q8a_results.shape)
    assert (q8a_results.shape == (73408, 3))

query8a = """ 
SELECT mc.PID as Actor, md.PID as Director, COUNT(mc.MID)
FROM M_Director md
JOIN M_cast mc ON md.MID=mc.MID
GROUP BY mc.PID,md.PID
"""
grader_8a(query8a)

        Actor   Director  COUNT(mc.MID)
0   nm0000002  nm0496746              1
1   nm0000027  nm0000180              1
2   nm0000039  nm0896533              1
3   nm0000042  nm0896533              1
4   nm0000047  nm0004292              1
5   nm0000073  nm0485943              1
6   nm0000076  nm0000229              1
7   nm0000092  nm0178997              1
8   nm0000093  nm0000269              1
9   nm0000096  nm0113819              1
(73408, 3)
CPU times: total: 484 ms
Wall time: 490 ms

In [5]:
%%time
# https://stackoverflow.com/questions/62852386/find-all-the-actors-that-made-more-movies-with-yash-chopra-than-any-other-direct
def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """ 
SELECT first.actor, first.count 
FROM   (SELECT Trim(actor) AS Actor, 
               Count(*)    AS COUNT 
        FROM   m_cast mc 
               INNER JOIN (SELECT m.mid 
                           FROM   movie m) AS m 
                       ON m.mid = Trim(mc.mid) 
               INNER JOIN (SELECT md.pid, 
                                  md.mid 
                           FROM   m_director md) AS md 
                       ON md.mid = Trim(mc.mid) 
               INNER JOIN (SELECT p.pid, 
                                  p.NAME AS actor 
                           FROM   person p) AS pactor 
                       ON pactor.pid = Trim(mc.pid) 
               INNER JOIN (SELECT p.pid, 
                                  p.NAME AS director 
                           FROM   person p) AS pdirector 
                       ON pdirector.pid = Trim(md.pid) 
        WHERE  director LIKE '%Yash Chopra%' 
        GROUP  BY Trim(actor)) first 
       LEFT JOIN (SELECT actor, 
                         Max(count) AS COUNT 
                  FROM   (SELECT DISTINCT Trim(actor) AS Actor, 
                                          Count(*)    AS COUNT 
                          FROM   m_cast mc 
                                 INNER JOIN (SELECT m.mid 
                                             FROM   movie m) AS m 
                                         ON m.mid = Trim(mc.mid) 
                                 INNER JOIN (SELECT md.pid, 
                                                    md.mid 
                                             FROM   m_director md) AS md 
                                         ON md.mid = Trim(mc.mid) 
                                 INNER JOIN (SELECT p.pid, 
                                                    p.NAME AS actor 
                                             FROM   person p) AS pactor 
                                         ON pactor.pid = Trim(mc.pid) 
                                 INNER JOIN (SELECT p.pid, 
                                                    p.NAME AS director 
                                             FROM   person p) AS pdirector 
                                         ON pdirector.pid = Trim(md.pid) 
                          WHERE  director NOT LIKE '%Yash Chopra%' 
                          GROUP  BY Trim(actor), 
                                    director) 
                  GROUP  BY actor) second 
              ON first.actor = second.actor 
WHERE  first.count >= second.count 
        OR second.actor IS NULL 
ORDER  BY first.count DESC 
"""
grader_8(query8)

              Actor  COUNT
0       Jagdish Raj     11
1  Manmohan Krishna     10
2          Iftekhar      9
3     Shashi Kapoor      7
4     Rakhee Gulzar      5
5    Waheeda Rehman      5
6    Achala Sachdev      4
7       Neetu Singh      4
8          Ravikant      4
9     Leela Chitnis      3
(237, 2)

AssertionError:

In [30]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """ 
WITH pair AS
(SELECT mc.PID as Actor, md.PID as Director, COUNT(mc.MID) AS Count
FROM M_Director md
JOIN M_cast mc ON md.MID=mc.MID
GROUP BY mc.PID,md.PID)
,
yash_pair AS
(SELECT * FROM pair pr WHERE pr.director IN
(SELECT TRIM(p.PID) FROM person p WHERE p.name LIKE "%Yash%Chopra%"))
,
no_yash_pair AS
(SELECT * FROM pair pr WHERE pr.director IN 
(SELECT TRIM(p.PID) FROM person p WHERE p.name NOT LIKE '%Yash%Chopra%'))

SELECT  pe.NAME,yp.count
FROM yash_pair yp
JOIN pair p ON (yp.actor=p.actor)
JOIN person pe ON (TRIM(yp.actor)=pe.PID)
WHERE (yp.count>p.count) OR (TRIM(yp.actor) NOT IN (p.actor))
GROUP BY p.actor
ORDER BY yp.count DESC
"""

qtt="""
SELECT TRIM(P.Name) AS ACTOR_NAME, COUNT(DISTINCT M.MID) AS YASH_CHOPRA_DIRECTED_MOVIES
FROM Person P 
JOIN M_Cast MC ON TRIM(MC.PID) = P.PID 
JOIN Movie M ON M.MID = MC.MID 
JOIN M_Director MD ON MD.MID = M.MID 
JOIN Person P1 ON P1.PID = TRIM(MD.PID)
WHERE TRIM(P1.Name) = 'Yash Chopra'  
GROUP BY TRIM(P.PID)
ORDER BY COUNT(DISTINCT M.MID) DESC

"""

qt="""
SELECT p1.PID,p1.name,count(movie.MID) as movie_with_yc
FROM person as p1 ,M_cash, movie
    join m_director ON (movie.MID=M_director.MID)
    JOIN Person AS p2 ON (M_director.PID=p2.PID)
    WHERE p2.nme = '%Yash%Chopra%'
    GROUP BY p1.PID
    HAVING count(Moive.MID) > ALL (SELECT COUNT(movie.MID)
    FROM Person AS p3 , M_cast,movie
    JOIN M_director ON (Movie.MID=M_Director.MID)
    JOIN Person AS p4 ON (M_director.PID=p4.MID)
    WHERE p1.PID=p3.PID and p4.name != '%Yash%Chopra%'
    GROUP BY p4.PID)
    ORDER BY movie_with_yc DESC
"""
grader_8(query8)

                Name  Count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3         Madan Puri      8
4        Vikas Anand      8
5        Anupam Kher      7
6      Shashi Kapoor      7
7   Amitabh Bachchan      6
8     Waheeda Rehman      5
9      Rakhee Gulzar      5
(430, 2)

AssertionError:

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [ ]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ *** Write a query that answers the 9th question ***"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

      S1_PID
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
Wall time: 178 ms

In [98]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))
    
query9a = """ 
WITH shk_MID AS (SELECT mc.MID
FROM Person p
JOIN M_Cast mc ON p.PID=TRIM(mc.PID)
WHERE p.name LIKE ('%Shah%Rukh%Khan%'))

SELECT p.PID AS S1_PID
FROM M_Cast mc
JOIN shk_MID sm ON mc.MID=sm.MID
JOIN Person p ON TRIM(mc.PID)=p.PID
WHERE p.name NOT LIKE '%Shah%Rukh%Khan%'
GROUP BY p.PID
"""
#2382
grader_9a(query9a)

      S1_PID
0  nm0000818
1  nm0000821
2  nm0001934
3  nm0002043
4  nm0004109
5  nm0004334
6  nm0004335
7  nm0004363
8  nm0004418
9  nm0004429
(2382, 1)
CPU times: total: 1.38 s
Wall time: 1.37 s

In [102]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """ *** Write a query that answers the 9th question ***"""
grader_9(query9)

DatabaseError: Execution failed on sql ' *** Write a query that answers the 9th question ***': near "*": syntax error

In [2]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """
WITH shk_MID AS (SELECT mc.MID
FROM Person p
JOIN M_Cast mc ON p.PID=TRIM(mc.PID)
WHERE p.name LIKE ('%Shah%Rukh%Khan%'))
,
PID_in_shk as
(SELECT mc.PID AS S1_PID
FROM M_Cast mc
JOIN shk_MID sm ON mc.MID=sm.MID
JOIN Person p ON TRIM(mc.PID)=p.PID
WHERE p.name NOT LIKE '%Shah%Rukh%Khan%'
GROUP BY p.PID)

SELECT * 
FROM person p
JOIn M_cast mc ON p.PID=TRIM(mc.PID)
WHERE p.PID = TRIM(PID_in_shk.PID)

"""

q2="""
WITH
    YASH_CHOPRAS_PID AS
    (
        SELECT
            TRIM(P.PID) AS PID
        FROM
            Person P
        WHERE
            Trim(P.Name) = 'Yash Chopra'
    ),
    NUM_OF_MOV_BY_ACTOR_DIRECTOR AS
    (
        SELECT
            TRIM(MC.PID) ACTOR_PID,
            TRIM(MD.PID) DIRECTOR_PID,
            COUNT(DISTINCT TRIM(MD.MID)) AS NUM_OF_MOV
        FROM
            M_Cast MC,
            M_Director MD
        WHERE
            TRIM(MC.MID)= TRIM(MD.MID)
        GROUP BY
            ACTOR_PID,
            DIRECTOR_PID
    ),
    NUM_OF_MOVIES_BY_YC AS
    (
        SELECT
            NM.ACTOR_PID,
            NM.DIRECTOR_PID,
            NM.NUM_OF_MOV NUM_OF_MOV_BY_YC
        FROM
            NUM_OF_MOV_BY_ACTOR_DIRECTOR NM,
            YASH_CHOPRAS_PID YCP
        WHERE
            NM.DIRECTOR_PID = YCP.PID
    ),
    MAX_MOV_BY_OTHER_DIRECTORS AS
    (
        SELECT
            ACTOR_PID,
            MAX(NUM_OF_MOV) MAX_NUM_OF_MOV
        FROM
            NUM_OF_MOV_BY_ACTOR_DIRECTOR NM,
            YASH_CHOPRAS_PID YCP
        WHERE
            NM.DIRECTOR_PID <> YCP.PID 
        GROUP BY
            ACTOR_PID
    ),
    ACTORS_MOV_COMPARISION AS
    (
    SELECT
        NMY.ACTOR_PID,
        CASE WHEN NMY.NUM_OF_MOV_BY_YC > IFNULL(NMO.MAX_NUM_OF_MOV,0) THEN 'Y' ELSE 'N' END MORE_MOV_BY_YC
    FROM
        NUM_OF_MOVIES_BY_YC NMY
        LEFT OUTER JOIN
        MAX_MOV_BY_OTHER_DIRECTORS NMO
        ON
        NMY.ACTOR_PID = NMO.ACTOR_PID 
    )
    SELECT
        DISTINCT
        TRIM(P.Name) ACTOR_NAME
    FROM
        Person P
    WHERE
        TRIM(P.PID) IN (
            SELECT
                DISTINCT
                ACTOR_PID
            FROM
                ACTORS_MOV_COMPARISION
            WHERE
                MORE_MOV_BY_YC = 'Y'
        )
"""
grader_9(q2)

NameError: name 'pd' is not defined